app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("first_name", "last_name", "email_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Adam"], ["last_name", "Wanninger"], ["email_address", "wanninaj@miamioh.edu"], ["created_at", "2015-08-22 14:34:45.479113"], ["updated_at", "2015-08-22 14:34:45.479113"]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "first_name" = ?, "last_name" = ?, "email_address" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["first_name", "Derp"], ["last_name", "Derp "], ["email_address", "Derp"], ["updated_at", "2015-08-23 16:26:19.548289"], ["id", 188]]